# ExportPatternInfo Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportPatternInfo Constructor
ExportPatternInfo Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExportPatternInfo()()()() | Constructs a new default ExportPatternInfo. |
| ExportPatternInfo(String) | Constructs a new ExportPatternInfo using the destination pattern name as input. |
| ExportPatternInfo(ExportPatternInfo) | Constructs a new copy of the input ExportPatternInfo object. |

# See Also
ExportPatternInfo Class
ExportPatternInfo Members
Autodesk.Revit.DB Namespace